# SetOpacityByClassN

## Description
```pascal
PROCEDURE SetOpacityByClassN(
				h                      : HANDLE;
				inIsPenOpacityByClass  : BOOLEAN;
				inIsFillOpacityByClass : BOOLEAN);
```

```python

def vs.SetOpacityByClassN(h, inIsPenOpacityByClass, inIsFillOpacityByClass):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|inIsPenOpacityByClass|BOOLEAN||
|inIsFillOpacityByClass|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* Object Attributes